chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usbhs/processor/usbhs_p32mz1024efk124.h
PLIB_INLINE_API USBHS_GEN_INTERRUPT PLIB_USBHS_GenInterruptFlagsGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_GenInterruptFlagsGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (USBHS_GEN_INTERRUPT)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_TxInterruptEnable(USBHS_MODULE_ID index, USBHS_EPTXRX_INTERRUPT interruptFlag)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_TxInterruptEnable_Default(index, interruptFlag);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_RxInterruptEnable(USBHS_MODULE_ID index, USBHS_EPTXRX_INTERRUPT interruptFlag)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_RxInterruptEnable_Default(index, interruptFlag);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_TxInterruptDisable(USBHS_MODULE_ID index, USBHS_EPTXRX_INTERRUPT interruptFlag)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_TxInterruptDisable_Default(index, interruptFlag);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_RxInterruptDisable(USBHS_MODULE_ID index, USBHS_EPTXRX_INTERRUPT interruptFlag)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_RxInterruptDisable_Default(index, interruptFlag);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsInterrupts(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsInterrupts_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_HighSpeedEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_HighSpeedEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_HighSpeedDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_HighSpeedDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_HighSpeedIsConnected(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_HighSpeedIsConnected_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_FullOrHighSpeedIsConnected(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_FullOrHighSpeedIsConnected_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsHighSpeedSupport(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsHighSpeedSupport_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_DMAErrorGet(USBHS_MODULE_ID index, uint8_t dmaChannel)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_DMAErrorGet_Default(index, dmaChannel);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_USBHS_DMAInterruptGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_DMAInterruptGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DMAOperationEnable(USBHS_MODULE_ID index, uint8_t endpoint, uint8_t dmaChannel, void* address, uint32_t count, bool direction)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DMAOperationEnable_Default(index, endpoint, dmaChannel, address, count, direction);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_LoadEPInIndex(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_LoadEPInIndex_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t* PLIB_USBHS_GetEP0FIFOAddress(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_GetEP0FIFOAddress_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (uint8_t*)0;
    }
}

PLIB_INLINE_API uint8_t* PLIB_USBHS_GetEP0CSRAddress(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_GetEP0CSRAddress_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (uint8_t*)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_USBHS_GetReceiveDataCount(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_GetReceiveDataCount_Default(index, endpoint);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_TestModeEnter(USBHS_MODULE_ID index, uint8_t testMode)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_TestModeEnter_Default(index, testMode);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_TestModeExit(USBHS_MODULE_ID index, uint8_t testMode)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_TestModeExit_Default(index, testMode);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsClockResetControl(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsClockResetControl_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_GlobalInterruptEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_GlobalInterruptEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_GlobalInterruptDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_GlobalInterruptDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResumeEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResumeEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResumeDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResumeDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SuspendEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SuspendEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SuspendDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SuspendDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResetEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResetEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_ResetDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_ResetDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

